OSCCAR/tutorials/template/pipeWithMovingLid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       7780;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       7800;
    }
    movingWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       7820;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       8020;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          8000;
        startFace       8220;
    }
)

// ************************************************************************* //
